dayuer/esp-airprint/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 控制台必须走 UART0（Micro-USB 调试口）：
# USB-OTG 外设被 host 模式占用后，原生 USB-Serial/JTAG 与之共用 GPIO19/20，用不了
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# 诊断用：把日志同时镜像到原生 USB-Serial/JTAG，
# 这样在切进 host 模式（PHY 被 OTG 接管）之前的输出能从 DEV 口看到
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 崩溃取证：coredump 写 flash，事后 idf.py coredump-info 读回溯
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
